app/views/articles/show.html.erb

<%= link_to "edit", edit_article_path(@article) %>
<h3>Comments (<%= @article.comments.size %>)</h3>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]