app/controllers/articles_controller.rb

    def destroy
        @article = Article.find(params[:id])
        flash.notice = "Article '#{@article.title}' Deleted!"
        @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 7]]