app/controllers/tags_controller.rb

  def destroy
      @tag = Tag.find(params[:id])
      flash.notice = "Tag '#{@tag.name}' Deleted!"
      @tag.destroy
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]